const POEMS = [
  {
    "n": 1,
    "kami": "秋の田の かりほの庵の 苫をあらみ",
    "shimo": "わが衣手は 露にぬれつつ",
    "author": "天智天皇",
    "color": "桃"
  },
  {
    "n": 2,
    "kami": "春過ぎて 夏来にけらし 白妙の",
    "shimo": "衣ほすてふ 天の香具山",
    "author": "持統天皇",
    "color": "黄"
  },
  {
    "n": 3,
    "kami": "あしびきの 山鳥の尾の しだり尾の",
    "shimo": "ながながし夜を ひとりかも寝む",
    "author": "柿本人麻呂",
    "color": "青"
  },
  {
    "n": 4,
    "kami": "田子の浦に うち出でて見れば 白妙の",
    "shimo": "富士の高嶺に 雪は降りつつ",
    "author": "山部赤人",
    "color": "桃"
  },
  {
    "n": 5,
    "kami": "奥山に もみぢ踏み分け 鳴く鹿の",
    "shimo": "声聞く時ぞ 秋は悲しき",
    "author": "猿丸大夫",
    "color": "青"
  },
  {
    "n": 6,
    "kami": "かささぎの 渡せる橋に おく霜の",
    "shimo": "白きを見れば 夜ぞ更けにける",
    "author": "中納言家持",
    "color": "青"
  },
  {
    "n": 7,
    "kami": "天の原 ふりさけ見れば 春日なる",
    "shimo": "三笠の山に 出
